In [ ]:
# Jupyter options for display

In [7]:
import pandas as pd

display_settings = {
    'max_columns': 30,
    'max_rows': 10,
    'precision': 2
}

for op, value in display_settings.items():
    pd.set_option("display.{}".format(op), value)

In [8]:
df = pd.read_csv("D:/MasterCopy-Notes/Course Contents/CJC/Code/Practice/data/londonweather.csv")
#df = pd.read_csv("D:/MasterCopy-Notes/Course Contents/CJC/Code/Practice/data/census_data.csv")

In [9]:
df

     Year  Month  Tmax  Tmin  Rain    Sun
0    1957      1   8.7   2.7  39.5   53.0
1    1957      2   9.0   2.9  69.8   64.9
2    1957      3  13.9   5.7  25.4   96.7
3    1957      4  14.2   5.2   5.7  169.6
4    1957      5  16.2   6.5  21.3  195.0
..    ...    ...   ...   ...   ...    ...
743  2018     12  10.7   5.2  60.6   40.3
744  2019      1   7.6   2.0  33.2   56.4
745  2019      2  12.4   3.3  34.2  120.2
746  2019      3  13.1   5.8  49.6  119.0
747  2019      4  15.8   5.7  12.8  170.1

[748 rows x 6 columns]

In [10]:
from IPython.core.display import display, HTML
display(HTML("<style>.container {width:90% !important;}</style>"))

In [38]:
invoices = pd.read_csv('D:\\MasterCopy-Notes\\Course Contents\\CJC\\Code\\Practice\\data\\invoices.csv')

In [39]:
invoices

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,12-04-2014,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,28-07-2015,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False
...,...,...,...,...,...,...,...,...,...
51362,4OMS8ZSA0UX8LHWI,20-09-2017,1TD5MROATV1NHZ4Y,E4K99D4JR9E40VE1,2017-09-21 08:00:00+02:00,['Regina Shirley'],9.0,Breakfast,False
51363,RR0VKJN8V0KHNKGG,19-03-2018,22EX9VZSJKHP4AIP,E4K99D4JR9E40VE1,2018-03-18 09:00:00+01:00,['Robin Ramos' 'Chester Mortimer'],25.0,Breakfast,False
51364,STJ6QJC30WPRM93H,21-09-2017,LMX18PNGWCIMG1QW,E4K99D4JR9E40VE1,2017-09-22 21:00:00+02:00,['Robin Ramos'],160.0,Dinner,False
51365,QHEUIYNC0XQX7GDR,28-01-2018,4U0VH2TGQL30X23X,E4K99D4JR9E40VE1,2018-02-01 21:00:00+01:00,['Chester Mortimer' 'Robin Ramos'],497.0,Dinner,False
51366,NKHFWT5I2J9LPAPG,06-09-2017,ORWFRT5TUSYGNYG7,E4K99D4JR9E40VE1,2017-09-09 14:00:00+02:00,['Chester Mortimer' 'Robin Ramos'],365.0,Lunch,False

In [13]:
invoices.columns

Index(['Order Id', 'Date', 'Meal Id', 'Company Id', 'Date of Meal',
       'Participants', 'Meal Price', 'Type of Meal', 'Heroes Adjustment'],
      dtype='object')

In [14]:
invoices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51367 entries, 0 to 51366
Data columns (total 9 columns):
Order Id             51367 non-null object
Date                 51367 non-null object
Meal Id              51367 non-null object
Company Id           51367 non-null object
Date of Meal         50017 non-null object
Participants         50017 non-null object
Meal Price           48667 non-null float64
Type of Meal         48667 non-null object
Heroes Adjustment    48667 non-null object
dtypes: float64(1), object(8)
memory usage: 3.5+ MB

Conversion of datatype of dataframe columns

In [24]:
invoices.dtypes

Order Id              object
Date                  object
Meal Id               object
Company Id            object
Date of Meal          object
Participants          object
Meal Price           float64
Type of Meal          object
Heroes Adjustment     object
dtype: object

In [45]:
invoices['Date of Meal'] = pd.to_datetime(invoices['Date of Meal'],utc=True)

In [46]:
invoices

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 05:00:00+00:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 18:00:00+00:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 12:00:00+00:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,12-04-2014,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 19:00:00+00:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,28-07-2015,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 12:00:00+00:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False
...,...,...,...,...,...,...,...,...,...
51362,4OMS8ZSA0UX8LHWI,20-09-2017,1TD5MROATV1NHZ4Y,E4K99D4JR9E40VE1,2017-09-21 06:00:00+00:00,['Regina Shirley'],9.0,Breakfast,False
51363,RR0VKJN8V0KHNKGG,19-03-2018,22EX9VZSJKHP4AIP,E4K99D4JR9E40VE1,2018-03-18 08:00:00+00:00,['Robin Ramos' 'Chester Mortimer'],25.0,Breakfast,False
51364,STJ6QJC30WPRM93H,21-09-2017,LMX18PNGWCIMG1QW,E4K99D4JR9E40VE1,2017-09-22 19:00:00+00:00,['Robin Ramos'],160.0,Dinner,False
51365,QHEUIYNC0XQX7GDR,28-01-2018,4U0VH2TGQL30X23X,E4K99D4JR9E40VE1,2018-02-01 20:00:00+00:00,['Chester Mortimer' 'Robin Ramos'],497.0,Dinner,False
51366,NKHFWT5I2J9LPAPG,06-09-2017,ORWFRT5TUSYGNYG7,E4K99D4JR9E40VE1,2017-09-09 12:00:00+00:00,['Chester Mortimer' 'Robin Ramos'],365.0,Lunch,False

In [47]:
invoices['Date of Meal'].dt.date

0        2016-05-31
1        2018-10-01
2        2014-08-23
3        2014-04-07
4        2015-07-27
            ...
51362    2017-09-21
51363    2018-03-18
51364    2017-09-22
51365    2018-02-01
51366    2017-09-09
Name: Date of Meal, Length: 51367, dtype: object

In [ ]:
# MAp function
# Filter
# Lambda
# Stcking
# Melt
# Pivot
# Pivot Table

In [ ]:
# Python Map function

In [48]:
# Return double of n 
def addition(n): 
    return n + n 
  
# We double all numbers using map() 
numbers = (1, 2, 3, 4) 
result = map(addition, numbers) 
print(list(result))

[2, 4, 6, 8]

In [49]:

# Double all numbers using map and lambda 
  
numbers = (1, 2, 3, 4) 
result = map(lambda x: x + x, numbers) 
print(list(result))

[2, 4, 6, 8]

In [107]:
# Add two lists using map and lambda 
  
numbers1 = [1, 2, 3] 
numbers2 = [4, 5, 6] 
  
result = map(lambda x, y: x + y, numbers1, numbers2) 
print(list(result)) 
# Can not print result directly without converting into list

[5, 7, 9]

In [89]:
sqrList = map(lambda x: x*x, [1, 2, 3, 4])
print(next(sqrList))
print(next(sqrList))
print(next(sqrList))
print(next(sqrList))

1
4
9
16

In [105]:
l=[1,2,3,4]
sl = map(lambda x: x*x, l)

In [108]:
list(sl)

[1, 4, 9, 16]

In [109]:
# Another example using standard python built in function pow
bases=[10, 20, 30, 40, 50]
index=[1, 2, 3, 4, 5]
powers=list(map(pow, bases, index))
powers

[10, 400, 27000, 2560000, 312500000]

In [51]:
# List of strings 
l = ['sat', 'bat', 'cat', 'mat'] 
  
# map() can listify the list of strings individually 
test = list(map(list, l)) 
print(test)

[['s', 'a', 't'], ['b', 'a', 't'], ['c', 'a', 't'], ['m', 'a', 't']]

The map() function is used to map values of Series according to input correspondence.

In [55]:
import numpy as np
import pandas as pd

In [56]:
s = pd.Series(['fox', 'cow', np.nan, 'dog'])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [59]:
a=s.map({'fox': 'cub', 'cow': 'calf'})

In [60]:
a

0     cub
1    calf
2     NaN
3     NaN
dtype: object

In [61]:
type(a)

pandas.core.series.Series

In [63]:
type(a[0])

str

In [58]:
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [64]:
s.map('I am a {}'.format)

0    I am a fox
1    I am a cow
2    I am a nan
3    I am a dog
dtype: object

To avoid applying the function to missing values (and keep them as NaN) na_action='ignore' can be used:

In [65]:
s.map('I am a {}'.format, na_action='ignore')

0    I am a fox
1    I am a cow
2           NaN
3    I am a dog
dtype: object

# Map values of Pandas Series

In [66]:
# we are going to use dataset Iris 
from sklearn.datasets import load_iris
data = load_iris()
features = pd.DataFrame(data = data['data'], columns= data ['feature_names'])
features.head() #glance at the data

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [67]:
#example : let's say, we would like to change the measurement of the sepal length from cm to mm, 
# this is what we can do with the map function and put a function call cm_to_mm inside. 

def cm_to_mm(cm):
    mm = cm * 10
    return mm

features['sepal length (cm)'].map(cm_to_mm).head() #this way, we have used this function on this pandas series

0    51.0
1    49.0
2    47.0
3    46.0
4    50.0
Name: sepal length (cm), dtype: float64

In [69]:
#what if we want to do it on two columns? 
features[['sepal length (cm)',"sepal width (cm)"]].map(cm_to_mm).head()

#And you can see, this does not work. This is when we will need the apply() function.

AttributeError: 'DataFrame' object has no attribute 'map'

Apply ( )

The apply () method works on panda series and data frames with a variety of functions easily applied depending on the datatype.

how does apply() function work

Similar to map(), when you use the apply() method on a series or a data frame, the function takes each element in the series and apply the function onto the element, then returns the transformed series or data frame.

In [70]:
#what if we want to do it on two columns? 
features[['sepal length (cm)',"sepal width (cm)"]].apply(cm_to_mm).head()

#and it works!!!!

   sepal length (cm)  sepal width (cm)
0               51.0              35.0
1               49.0              30.0
2               47.0              32.0
3               46.0              31.0
4               50.0              36.0

Well, of course, it does not make sense if we only change two columns in the dataset from cm to mm.

The next question is, what if we want to change the entire data frame? There are two ways we can do this.
- with apply().
- with applymap().

In [72]:
# with apply()
features[['sepal length (cm)','sepal width (cm)',
          'petal length (cm)','petal width (cm)']].apply(cm_to_mm).head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

And it works!! But, there is just way too much typing for me with all the variable names and names and names and names… And what if there are 15 columns in your data frame, or 50… OR 500!!!

Let me introduce you to applymap( ), our lifesaver today!!
Applymap ( )

The applymap() method works on the entire pandas data frame where the input function is applied to every element individually. In other words, applymap() is appy() + map()!

In [73]:
#so this is what we do, we use applymap()
features.applymap(cm_to_mm).head()

#Let me save this dataframe into a new data frame and rename it 

iris = features.applymap(cm_to_mm).head()
iris.columns = ['sepal length (mm)', 'sepal width (mm)', 
                'petal length (mm)', 'petal width (mm)'] 
iris.head()

   sepal length (mm)  sepal width (mm)  petal length (mm)  petal width (mm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

Combining Lambda Function With Apply( )

In the previous sections, we talked about the lambda function as well as map(), apply(), and applymap() individually. Now, let's combine them and see why they work so well with one another.

If you go back to the beginning of the post, you will notice that I wrote a function cm_to_mmto perform the transformation in each column. Here is a quick reminder of the function:

def cm_to_mm(cm):
    mm = cm * 10
    return mm
    
    
As you can see, this function is not that complicated, all we did was take a number, and then multiply the number by 10. This function can be easily transformed into a lambda function.

lambda x: x*10

In [74]:
#instead of the cm_to_mm function, I will just the lambda function to tranform the dataset 
features[['sepal length (cm)']].apply(lambda x: x*10).head()

   sepal length (cm)
0               51.0
1               49.0
2               47.0
3               46.0
4               50.0

In [75]:
# Now try it with the entire dataframe 
features.applymap(lambda x: x*10).head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0               51.0              35.0               14.0               2.0
1               49.0              30.0               14.0               2.0
2               47.0              32.0               13.0               2.0
3               46.0              31.0               15.0               2.0
4               50.0              36.0               14.0               2.0

More Examples

Of course, the example above is only one of the ways to use apply(), map(), applymap() functions. In the following section, I will show you some cool ways to use apply-lambda combination.

Example 1, Create a new column with existing columns

In [76]:
# create a list of all the columns' name 
col_name = ['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']

#create a new column call interation using lambda and apply function 
features['interaction'] = features.apply(lambda x : x[col_name[0]]*x[col_name[1]]*\
                                         x[col_name[2]]* x[col_name[3]], axis = 1)

features.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),interaction
0,5.1,3.5,1.4,0.2,5.00
1,4.9,3.0,1.4,0.2,4.12
2,4.7,3.2,1.3,0.2,3.91
3,4.6,3.1,1.5,0.2,4.28
4,5.0,3.6,1.4,0.2,5.04

Example 2, apply- lambda with strings extraction

In [80]:
# let's say we have a dataframe with names 
name = pd.DataFrame(data = ['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)'], columns = ['Name'] )

#Take a look at the Data 
name.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [82]:
#Let's say, I want to extract the Titles of each name, we can do this: 

#name['Name'].apply(lambda x: x.split(" ")[1].replace(".", ""))

#save this output to "title"
name['Title'] = name['Name'].apply(lambda x: x.split(" ")[1].replace(".", ""))

#take a look at out dataframe 
#name

In [83]:
name.columns

Index(['Name', 'Title'], dtype='object')

In [84]:
name

                                                Name   Title
0                            Braund, Mr. Owen Harris      Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Mrs
2                             Heikkinen, Miss. Laina    Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Mrs
4                           Allen, Mr. William Henry      Mr
5                                   Moran, Mr. James      Mr
6                            McCarthy, Mr. Timothy J      Mr
7                     Palsson, Master. Gosta Leonard  Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)     Mrs

In [ ]:
# Misc topic

In [54]:

# inbuilt function return an  
# integer representing the Unicode code 
value = ord("A") 
  
# writing in ' ' gives the same result 
value1 = ord('a') 
  
# prints the unicode value 
print(value, value1)

65 97

# Stacking

In [18]:
import pandas as pd

players_data = {'Player': ['Superman', 'Batman', 'Thanos', 'Batman', 'Thanos',
   'Superman', 'Batman', 'Thanos', 'Black Widow', 'Batman', 'Thanos', 'Superman'],
   'Year': [2000,2000,2000,2001,2001,2002,2002,2002,2003,2004,2004,2005],
   'Points':[23,43,45,65,76,34,23,78,89,76,92,87]}
   
df = pd.DataFrame(players_data)

In [19]:
df

         Player  Year  Points
0      Superman  2000      23
1        Batman  2000      43
2        Thanos  2000      45
3        Batman  2001      65
4        Thanos  2001      76
..          ...   ...     ...
7        Thanos  2002      78
8   Black Widow  2003      89
9        Batman  2004      76
10       Thanos  2004      92
11     Superman  2005      87

[12 rows x 3 columns]

Stacking

Stacking transforms the DataFrame into having a multi-level index, i.e., each row has multiple sub-parts. These sub-parts are created using the DataFrame’s columns, compressing them into the multi-index. Overall, stacking can be thought of as compressing columns into multi-index rows.

In [21]:
df = df.stack()

print(df)

0   Player    Superman
    Year          2000
    Points          23
1   Player      Batman
    Year          2000
                ...
10  Year          2004
    Points          92
11  Player    Superman
    Year          2005
    Points          87
Length: 36, dtype: object

In [166]:
import pandas as pd
df = pd.read_csv("D:/MasterCopy-Notes/Course Contents/CJC/Code/Practice/data/pandas_users.csv")
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [167]:
df = df.set_index(['city','weekday'])
df

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

df.unstack? 

Pivot a level of the (necessarily hierarchical) index labels, returning
a DataFrame having a new level of column labels whose inner-most level
consists of the pivoted index labels.

If the index is not a MultiIndex, the output will be a Series

In [169]:
byweekday = df.unstack(level = 'weekday')
byweekday

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [170]:
#  revert it
df1 = byweekday.stack(level = 'weekday')
df1

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [ ]:
# Filter function 
# Query String

In [110]:
import pandas as pd
data = {'name': ['Jack', 'Frank', 'Kelly', 'Rebecca', "Monica"], 
        'year': [2015, 2011, 2010, 2014, None], 
        'reports': [24, 4, 2, 31, None]}
df = pd.DataFrame(data, index = ['New York', 'New Orleans', 'Budapest', 'Helsinki', "Cologne"])

In [111]:
df

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0
Cologne       Monica     NaN      NaN

In [112]:
df.query('year > 2012 | name == "Frank"')  # Showing only the rows where the year is greater than 2012 OR name is “Frank”:

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Helsinki     Rebecca  2014.0     31.0

The filter() function is used to subset rows or columns of dataframe according to labels in the specified index.

In [145]:
import numpy as np
import pandas as pd


df = pd.DataFrame(np.array(([2, 3, 4], [5, 6, 7])),
                  index=['bat', 'cat'],
                  columns=['onE', 'two', 'three'])

In [147]:
# select columns by name
df.filter(items=['onE', 'three'])

     onE  three
bat    2      4
cat    5      7

In [148]:
# select columns by regular expression
df.filter(regex='^o', axis=1) # selects columns starts with o

     onE
bat    2
cat    5

In [151]:
# select columns by regular expression
df.filter(regex='[eE]', axis=1)  # selects columns ends with eE

     onE  three
bat    2      4
cat    5      7

In [152]:
# select columns by regular expression
df.filter(regex = '[E]', axis=1)  # selects columns ends with o

     onE
bat    2
cat    5

In [153]:
# select rows containing 'ca'
df.filter(like='ca', axis=0)

     onE  two  three
cat    5    6      7

In [154]:
# select rows containing 'c'
df.filter(like='c', axis=0)

     onE  two  three
cat    5    6      7

In [155]:
# select rows containing 'bt'
df.filter(like='bt', axis=0)

Empty DataFrame
Columns: [onE, two, three]
Index: []

In [156]:
# select rows containing 'ba'
df.filter(like='ba', axis=0)

     onE  two  three
bat    2    3      4

In [157]:
# select rows containing 'b'
df.filter(like='b', axis=0)

     onE  two  three
bat    2    3      4

# Pivot
Return reshaped DataFrame organized by given index / column values.

In [160]:
import pandas as pd
df = pd.read_csv("D:/MasterCopy-Notes/Course Contents/CJC/Code/Practice/data/pandas_users.csv")
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

Pivot Data with one metric(visitors)

In [162]:
visitors_pivot = df.pivot(index = 'weekday',
                          columns = 'city',
                          values = 'visitors')
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

Pivot data with one metric(signups)

In [163]:
# weekday and city wise, Number of signups
signups_pivot = df.pivot(index = 'weekday',
                         columns='city',
                         values = 'signups')
signups_pivot

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

Pivot data with all metrics

In [164]:
# weekday and city wise, number of visitors and signups
visitors_signups_pivot = df.pivot(index = 'weekday',
                                  columns='city')
visitors_signups_pivot

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

Or same output can be extracted using below

In [165]:
df.pivot(index="weekday",
        columns="city",
        values=["visitors","signups"])

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [ ]:
# Pivot with another example

In [190]:
gapminder = pd.read_csv('D:\\MasterCopy-Notes\\Course Contents\\CJC\\Code\Practice\\data\\gapreminder.csv')
print(gapminder.head())

       country  year       pop continent  lifeExp  gdpPercap
0  Afghanistan  1952  8.43e+06      Asia    28.80     779.45
1  Afghanistan  1957  9.24e+06      Asia    30.33     820.85
2  Afghanistan  1962  1.03e+07      Asia    32.00     853.10
3  Afghanistan  1967  1.15e+07      Asia    34.02     836.20
4  Afghanistan  1972  1.31e+07      Asia    36.09     739.98

In [191]:
groupbycontinent = gapminder.groupby('continent')

In [192]:
groupbycontinent.mean()['lifeExp']

continent
Africa      48.87
Americas    64.66
Asia        60.06
Europe      71.90
Oceania     74.33
Name: lifeExp, dtype: float64

In [193]:
df = gapminder[['continent','lifeExp']]
print(df.shape)

(1704, 2)

In [194]:
df

     continent  lifeExp
0         Asia    28.80
1         Asia    30.33
2         Asia    32.00
3         Asia    34.02
4         Asia    36.09
...        ...      ...
1699    Africa    62.35
1700    Africa    60.38
1701    Africa    46.81
1702    Africa    39.99
1703    Africa    43.49

[1704 rows x 2 columns]

In [175]:
# simple example with pivot_table
pd.pivot_table(df, values='lifeExp',        # gives mean for all continent
                   columns='continent')

continent  Africa  Americas   Asia  Europe  Oceania
lifeExp     48.87     64.66  60.06    71.9    74.33

Pandas pivot_table on a data frame with three columns

Pandas pivot_table gets more useful when we try to summarize and convert a tall data frame with more than two variables into a wide data frame

In [195]:
df1 = gapminder[['continent', 'year','lifeExp']]

# pivot table example with three columns
pd.pivot_table(df1, values  = 'lifeExp',        # Mean 
                    index   = ['year'], 
                    columns = 'continent')

continent  Africa  Americas   Asia  Europe  Oceania
year
1952        39.14     53.28  46.31   64.41    69.25
1957        41.27     55.96  49.32   66.70    70.30
1962        43.32     58.40  51.56   68.54    71.09
1967        45.33     60.41  54.66   69.74    71.31
1972        47.45     62.39  57.32   70.78    71.91
...           ...       ...    ...     ...      ...
1987        53.34     68.09  64.85   73.64    75.32
1992        53.63     69.57  66.54   74.44    76.94
1997        53.60     71.15  68.02   75.51    78.19
2002        53.33     72.42  69.23   76.70    79.74
2007        54.81     73.61  70.73   77.65    80.72

[12 rows x 5 columns]

Pandas pivot_table with Different Aggregating Function

In [196]:
# pivot table example with aggfunc='min'
pd.pivot_table(df1, values='lifeExp',          # min of continent, year
                    index=['year'], 
                    columns='continent',
                    aggfunc='min')

continent  Africa  Americas   Asia  Europe  Oceania
year
1952        30.00     37.58  28.80   43.59    69.12
1957        31.57     40.70  30.33   48.08    70.26
1962        32.77     43.43  32.00   52.10    70.93
1967        34.11     45.03  34.02   54.34    71.10
1972        35.40     46.71  36.09   57.01    71.89
...           ...       ...    ...     ...      ...
1987        39.91     53.64  40.82   63.11    74.32
1992        23.60     55.09  41.67   66.15    76.33
1997        36.09     56.67  41.76   68.83    77.55
2002        39.19     58.14  42.13   70.84    79.11
2007        39.61     60.92  43.83   71.78    80.20

[12 rows x 5 columns]

# Melt function
- Pandas melt() function is used to change the DataFrame format from wide to long. 
- To make analysis of data in table easier, we can reshape the data into a more computer-friendly form using Pandas in Python
- Pandas.melt() unpivots a DataFrame from wide format to long format.
- melt() function is useful to massage a DataFrame into a format where one or more columns are identifier variables, while all other columns, considered measured variables, are unpivoted to the row axis, leaving just two non-identifier columns, variable and value.
- It’s used to create a specific format of the DataFrame object where one or more columns work as identifiers. 
- All the remaining columns are treated as values and unpivoted to the row axis and only two columns – variable and value.

In [200]:
import pandas as pd

d1 = {"Name": ["Pankaj", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}
df = pd.DataFrame(d1)
print(df)
print('\n')

df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"])
print(df_melted)

     Name  ID    Role
0  Pankaj   1     CEO
1    Lisa   2  Editor
2   David   3  Author


   ID variable   value
0   1     Name  Pankaj
1   2     Name    Lisa
2   3     Name   David
3   1     Role     CEO
4   2     Role  Editor
5   3     Role  Author

In [201]:
# Multiple Columns as id_vars
df_melted = pd.melt(df, id_vars=["ID", "Name"], value_vars=["Role"])
print(df_melted)

   ID    Name variable   value
0   1  Pankaj     Role     CEO
1   2    Lisa     Role  Editor
2   3   David     Role  Author

# Skipping Columns in melt() Function

It’s not required to use all the rows from the source DataFrame. Let’s skip the “ID” column in the next example.

In [202]:
df_melted = pd.melt(df, id_vars=["Name"], value_vars=["Role"])
print(df_melted)

     Name variable   value
0  Pankaj     Role     CEO
1    Lisa     Role  Editor
2   David     Role  Author

# Sorting 
Pandas sort_values() function sorts a data frame in Ascending or Descending order of passed Column.

In [204]:
gapminder = pd.read_csv('D:\\MasterCopy-Notes\\Course Contents\\CJC\\Code\Practice\\data\\gapreminder.csv')

In [206]:
gapminder

          country  year       pop continent  lifeExp  gdpPercap
0     Afghanistan  1952  8.43e+06      Asia    28.80     779.45
1     Afghanistan  1957  9.24e+06      Asia    30.33     820.85
2     Afghanistan  1962  1.03e+07      Asia    32.00     853.10
3     Afghanistan  1967  1.15e+07      Asia    34.02     836.20
4     Afghanistan  1972  1.31e+07      Asia    36.09     739.98
...           ...   ...       ...       ...      ...        ...
1699     Zimbabwe  1987  9.22e+06    Africa    62.35     706.16
1700     Zimbabwe  1992  1.07e+07    Africa    60.38     693.42
1701     Zimbabwe  1997  1.14e+07    Africa    46.81     792.45
1702     Zimbabwe  2002  1.19e+07    Africa    39.99     672.04
1703     Zimbabwe  2007  1.23e+07    Africa    43.49     469.71

[1704 rows x 6 columns]

In [208]:
gapminder.sort_values("country",  ascending = False) # descending order on country # inplace=true, na_last=True

          country  year       pop continent  lifeExp  gdpPercap
1703     Zimbabwe  2007  1.23e+07    Africa    43.49     469.71
1697     Zimbabwe  1977  6.64e+06    Africa    57.67     685.59
1692     Zimbabwe  1952  3.08e+06    Africa    48.45     406.88
1693     Zimbabwe  1957  3.65e+06    Africa    50.47     518.76
1694     Zimbabwe  1962  4.28e+06    Africa    52.36     527.27
...           ...   ...       ...       ...      ...        ...
8     Afghanistan  1992  1.63e+07      Asia    41.67     649.34
9     Afghanistan  1997  2.22e+07      Asia    41.76     635.34
10    Afghanistan  2002  2.53e+07      Asia    42.13     726.73
11    Afghanistan  2007  3.19e+07      Asia    43.83     974.58
0     Afghanistan  1952  8.43e+06      Asia    28.80     779.45

[1704 rows x 6 columns]

In [209]:
gapminder.sort_values("country", ascending = True) # ascending order on country # inplace=true, na_last=True

          country  year       pop continent  lifeExp  gdpPercap
0     Afghanistan  1952  8.43e+06      Asia    28.80     779.45
11    Afghanistan  2007  3.19e+07      Asia    43.83     974.58
10    Afghanistan  2002  2.53e+07      Asia    42.13     726.73
9     Afghanistan  1997  2.22e+07      Asia    41.76     635.34
7     Afghanistan  1987  1.39e+07      Asia    40.82     852.40
...           ...   ...       ...       ...      ...        ...
1693     Zimbabwe  1957  3.65e+06    Africa    50.47     518.76
1692     Zimbabwe  1952  3.08e+06    Africa    48.45     406.88
1702     Zimbabwe  2002  1.19e+07    Africa    39.99     672.04
1696     Zimbabwe  1972  5.86e+06    Africa    55.63     799.36
1703     Zimbabwe  2007  1.23e+07    Africa    43.49     469.71

[1704 rows x 6 columns]

In [212]:
gapminder.sort_values("year", ascending = True, 
                      na_position ='first')

                 country  year       pop continent  lifeExp  gdpPercap
0            Afghanistan  1952  8.43e+06      Asia    28.80     779.45
528               France  1952  4.25e+07    Europe    67.41    7029.81
540                Gabon  1952  4.21e+05    Africa    37.00    4293.48
1656  West Bank and Gaza  1952  1.03e+06      Asia    43.16    1515.59
552               Gambia  1952  2.84e+05    Africa    30.00     485.23
...                  ...   ...       ...       ...      ...        ...
1127               Niger  2007  1.29e+07    Africa    56.87     619.68
1139             Nigeria  2007  1.35e+08    Africa    46.86    2013.98
1151              Norway  2007  4.63e+06    Europe    80.20   49357.19
1175            Pakistan  2007  1.69e+08      Asia    65.48    2605.95
1703            Zimbabwe  2007  1.23e+07    Africa    43.49     469.71

[1704 rows x 6 columns]

In [224]:
# Ascending on year and descending on country
gapminder.sort_values(by=["year","country"], ascending = [True, False],
                      na_position ='first',kind='quicksort')  # mergesort, heapsort

                 country  year       pop continent  lifeExp  gdpPercap
1692            Zimbabwe  1952  3.08e+06    Africa    48.45     406.88
1680              Zambia  1952  2.67e+06    Africa    42.04    1147.39
1668          Yemen Rep.  1952  4.96e+06      Asia    32.55     781.72
1656  West Bank and Gaza  1952  1.03e+06      Asia    43.16    1515.59
1644             Vietnam  1952  2.62e+07      Asia    40.41     605.07
...                  ...   ...       ...       ...      ...        ...
59             Argentina  2007  4.03e+07  Americas    75.32   12779.38
47                Angola  2007  1.24e+07    Africa    42.73    4797.23
35               Algeria  2007  3.33e+07    Africa    72.30    6223.37
23               Albania  2007  3.60e+06    Europe    76.42    5937.03
11           Afghanistan  2007  3.19e+07      Asia    43.83     974.58

[1704 rows x 6 columns]

In [225]:
gapminder.columns

Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [229]:
gapminder.set_index('year', inplace=True)

In [230]:
gapminder

          country       pop continent  lifeExp  gdpPercap
year
1952  Afghanistan  8.43e+06      Asia    28.80     779.45
1957  Afghanistan  9.24e+06      Asia    30.33     820.85
1962  Afghanistan  1.03e+07      Asia    32.00     853.10
1967  Afghanistan  1.15e+07      Asia    34.02     836.20
1972  Afghanistan  1.31e+07      Asia    36.09     739.98
...           ...       ...       ...      ...        ...
1987     Zimbabwe  9.22e+06    Africa    62.35     706.16
1992     Zimbabwe  1.07e+07    Africa    60.38     693.42
1997     Zimbabwe  1.14e+07    Africa    46.81     792.45
2002     Zimbabwe  1.19e+07    Africa    39.99     672.04
2007     Zimbabwe  1.23e+07    Africa    43.49     469.71

[1704 rows x 5 columns]

In [232]:
gapminder.sort_index(ascending=False)

                country       pop continent  lifeExp  gdpPercap
year
2007           Zimbabwe  1.23e+07    Africa    43.49     469.71
2007  Equatorial Guinea  5.51e+05    Africa    51.58   12154.09
2007           Ethiopia  7.65e+07    Africa    52.95     690.81
2007            Finland  5.24e+06    Europe    79.31   33207.08
2007             France  6.11e+07    Europe    80.66   30470.02
...                 ...       ...       ...      ...        ...
1952              Niger  3.38e+06    Africa    37.44     761.88
1952            Nigeria  3.31e+07    Africa    36.32    1077.28
1952             Norway  3.33e+06    Europe    72.67   10095.42
1952               Oman  5.08e+05      Asia    37.58    1828.23
1952             Kuwait  1.60e+05      Asia    55.56  108382.35

[1704 rows x 5 columns]

# Change Data Type for one or more columns in Pandas Dataframe

In [233]:
# importing pandas as pd 
import pandas as pd 
  
df = pd.DataFrame({ 
    'A': [1, 2, 3, 4, 5], 
    'B': ['a', 'b', 'c', 'd', 'e'], 
    'C': [1.1, '1.0', '1.3', 2, 5] }) 
  
# converting all columns to string type 
df = df.astype(str) 
print(df.dtypes)

A    object
B    object
C    object
dtype: object

In [234]:
df = pd.DataFrame({ 
    'A': [1, 2, 3, 4, 5], 
    'B': ['a', 'b', 'c', 'd', 'e'], 
    'C': [1.1, '1.0', '1.3', 2, 5] }) 
  
# using dictionary to convert specific columns 
convert_dict = {'A': int, 
                'C': float
               } 
  
df = df.astype(convert_dict) 
print(df.dtypes)

A      int32
B     object
C    float64
dtype: object

In [235]:
#Using DataFrame.apply()

df = pd.DataFrame({ 
    'A': [1, 2, 3, '4', '5'], 
    'B': ['a', 'b', 'c', 'd', 'e'], 
    'C': [1.1, '2.1', 3.0, '4.1', '5.1'] }) 
  
# using apply method 
df[['A', 'C']] = df[['A', 'C']].apply(pd.to_numeric) 
print(df.dtypes)

A      int64
B     object
C    float64
dtype: object

In [236]:
# Using DataFrame.infer_objects()

df = pd.DataFrame({ 
    'A': [1, 2, 3, 4, 5], 
    'B': ['a', 'b', 'c', 'd', 'e'], 
    'C': [1.1, 2.1, 3.0, 4.1, 5.1] 
     }, dtype ='object') 
  
# converting datatypes 
df = df.infer_objects() 
print(df.dtypes)

A      int64
B     object
C    float64
dtype: object

# np.where clause

In [ ]:
import numpy as np

In [ ]:
# call numpy.where() with 3 arguments
result = np.where([True, False, False], [1, 2, 4], [7, 8, 9])
print('Contents of Numpy array returned: ', result, sep='\n')

In [ ]:
# Create a Numpy array from a list
arr = np.array([11, 12, 13])
# call numpy.where() with 3 arguments
result = np.where(arr < 12, [1, 2, 4], [7, 8, 9]) 
print('Contents of Numpy array returned: ', result, sep='\n')

In [ ]:
print('*** Use numpy.where() condition argument only ***')
 
# Create a numpy array from list
arr = np.array([11, 12, 13, 14, 15, 16, 17, 15, 11, 12, 14, 15, 16, 17])
# pass condition expression only
result = np.where((arr > 12) & (arr < 16))
if len(result) > 0:
    print('Elements in given range exists at following Index :', result)
else:
    print('Element Not Found')